In [1]:
import numpy as np
import pandas as pd
import sqlite3
con=sqlite3.connect('HR.db')
cur=con.cursor()
%load_ext sql
%sql sqlite:///'HR.db'

"Connected: @'HR.db'"

In [3]:
import prettytable
prettytable.DEFAULT='DEFAULT'

In [5]:
%%sql
CREATE TABLE PETSALE (
	ID INTEGER NOT NULL,
	ANIMAL VARCHAR(20),
	SALEPRICE DECIMAL(6,2),
	SALEDATE DATE,
	QUANTITY INTEGER,
	PRIMARY KEY (ID)
	);
INSERT INTO PETSALE VALUES
(1,'Cat',450.09,'2018-05-29',9),
(2,'Dog',666.66,'2018-06-01',3),
(3,'Parrot',50.00,'2018-06-04',2),
(4,'Hamster',60.60,'2018-06-11',6),
(5,'Goldfish',48.48,'2018-06-14',24);

 * sqlite:///'HR.db'
(sqlite3.OperationalError) table PETSALE already exists
[SQL: CREATE TABLE PETSALE (
	ID INTEGER NOT NULL,
	ANIMAL VARCHAR(20),
	SALEPRICE DECIMAL(6,2),
	SALEDATE DATE,
	QUANTITY INTEGER,
	PRIMARY KEY (ID)
	);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [6]:
%sql SELECT * FROM PETSALE

 * sqlite:///'HR.db'
Done.

[(1, 'Cat', 450.09, '2018-05-29', 9),
 (2, 'Dog', 666.66, '2018-06-01', 3),
 (3, 'Parrot', 50, '2018-06-04', 2),
 (4, 'Hamster', 60.6, '2018-06-11', 6),
 (5, 'Goldfish', 48.48, '2018-06-14', 24)]

In [9]:
%%sql
DELIMITER //

CREATE PROCEDURE RETRIEVE_ALL()

BEGIN
   SELECT *  FROM PETSALE;
END //
DELIMITER ;

 * sqlite:///'HR.db'
(sqlite3.OperationalError) near "DELIMITER": syntax error
[SQL: DELIMITER //

CREATE PROCEDURE RETRIEVE_ALL()

BEGIN
   SELECT *  FROM PETSALE;
END //
DELIMITER ;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [8]:
%%sql
CALL RETRIEVE_ALL;

 * sqlite:///'HR.db'
(sqlite3.OperationalError) near "CALL": syntax error
[SQL: CALL RETRIEVE_ALL;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [10]:
%%sql
CREATE TABLE BankAccounts (
    AccountNumber VARCHAR(5) NOT NULL,
    AccountName VARCHAR(25) NOT NULL,
    Balance DECIMAL(8,2) CHECK(Balance>=0) NOT NULL,
    PRIMARY KEY (AccountNumber)
    );
INSERT INTO BankAccounts VALUES
('B001','Rose',300),
('B002','James',1345),
('B003','Shoe Shop',124200),
('B004','Corner Shop',76000);
SELECT * FROM BankAccounts;

 * sqlite:///'HR.db'
Done.
4 rows affected.
Done.

[('B001', 'Rose', 300),
 ('B002', 'James', 1345),
 ('B003', 'Shoe Shop', 124200),
 ('B004', 'Corner Shop', 76000)]

In [11]:
%%sql
CREATE TABLE ShoeShop (
    Product VARCHAR(25) NOT NULL,
    Stock INTEGER NOT NULL,
    Price DECIMAL(8,2) CHECK(Price>0) NOT NULL,
    PRIMARY KEY (Product)
    );
INSERT INTO ShoeShop VALUES
('Boots',11,200),
('High heels',8,600),
('Brogues',10,150),
('Trainers',14,300);
select * from ShoeShop;

 * sqlite:///'HR.db'
Done.
4 rows affected.
Done.

[('Boots', 11, 200),
 ('High heels', 8, 600),
 ('Brogues', 10, 150),
 ('Trainers', 14, 300)]